In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv("mtcars.csv")

In [3]:
df.head()

,Unnamed: 0,vichle_names,mpg,cyl,disp,hp,drat,wt,qsec,v_Shape,am,gear,carb
0,0,Mazda RX4,21.0,6,160.0,110.0,3.90,2.620,16.46,0.0,1.0,4.0,4
1,1,Mazda RX4 Wag,21.0,6,160.0,110.0,3.90,2.875,17.02,0.0,1.0,4.0,4
2,2,Datsun 710,NaN,4,108.0,93.0,3.85,2.320,18.61,1.0,1.0,4.0,1
3,3,Hornet 4 Drive,21.4,6,258.0,NaN,3.08,3.215,19.44,1.0,0.0,3.0,1
4,4,Hornet Sportabout,18.7,8,360.0,175.0,3.15,3.440,17.02,0.0,0.0,NaN,2

In [4]:
df.shape

(32, 13)

In [5]:
df.tail()

,Unnamed: 0,vichle_names,mpg,cyl,disp,hp,drat,wt,qsec,v_Shape,am,gear,carb
27,27,Lotus Europa,30.4,4,95.1,113.0,3.77,1.513,16.9,1.0,1.0,5.0,2
28,28,Ford Pantera L,15.8,8,351.0,264.0,4.22,3.170,14.5,0.0,1.0,5.0,4
29,29,Ferrari Dino,19.7,6,145.0,175.0,3.62,2.770,15.5,0.0,1.0,5.0,6
30,30,Maserati Bora,15.0,8,301.0,335.0,3.54,3.570,14.6,0.0,1.0,5.0,8
31,31,Volvo 142E,21.4,4,121.0,109.0,4.11,2.780,18.6,1.0,1.0,4.0,2

In [6]:
l=[]
for column in df.columns:
    l.append(column)

In [7]:
l

['Unnamed: 0',
 'vichle_names',
 'mpg',
 'cyl',
 'disp',
 'hp',
 'drat',
 'wt',
 'qsec',
 'v_Shape',
 'am',
 'gear',
 'carb']

In [8]:
list(df.columns)

['Unnamed: 0',
 'vichle_names',
 'mpg',
 'cyl',
 'disp',
 'hp',
 'drat',
 'wt',
 'qsec',
 'v_Shape',
 'am',
 'gear',
 'carb']

In [9]:
df.isnull().mean()*100

Unnamed: 0       0.000
vichle_names     0.000
mpg              6.250
cyl              0.000
disp             0.000
hp               3.125
drat             3.125
wt               0.000
qsec             9.375
v_Shape          6.250
am              12.500
gear             9.375
carb             0.000
dtype: float64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    32 non-null     int64
 1   vichle_names  32 non-null     object
 2   mpg           30 non-null     float64
 3   cyl           32 non-null     int64
 4   disp          32 non-null     float64
 5   hp            31 non-null     float64
 6   drat          31 non-null     float64
 7   wt            32 non-null     float64
 8   qsec          29 non-null     float64
 9   v_Shape       30 non-null     float64
 10  am            28 non-null     float64
 11  gear          29 non-null     float64
 12  carb          32 non-null     int64
dtypes: float64(9), int64(3), object(1)
memory usage: 3.4+ KB

In [11]:
df_num = df.select_dtypes(exclude=['object'])
df_obj = df.select_dtypes(include=['object'])

In [12]:
df_obj

           vichle_names
0             Mazda RX4
1         Mazda RX4 Wag
2            Datsun 710
3        Hornet 4 Drive
4     Hornet Sportabout
5               Valiant
6            Duster 360
7             Merc 240D
8              Merc 230
9              Merc 280
10            Merc 280C
11           Merc 450SE
12           Merc 450SL
13          Merc 450SLC
14   Cadillac Fleetwood
15  Lincoln Continental
16    Chrysler Imperial
17             Fiat 128
18          Honda Civic
19       Toyota Corolla
20        Toyota Corona
21     Dodge Challenger
22          AMC Javelin
23           Camaro Z28
24     Pontiac Firebird
25            Fiat X1-9
26        Porsche 914-2
27         Lotus Europa
28       Ford Pantera L
29         Ferrari Dino
30        Maserati Bora
31           Volvo 142E

In [13]:
print(df.index.name)

None

In [14]:
df.index.name= "My_Index"

In [15]:
name= ['gta','rat','lat']
deg = ['BE','B.Tech','ITUS']
score =['90','67','00']
dict= {'name':name, 'deg':deg, 'score':score}
df_d=pd.DataFrame(dict)

In [16]:
df_d

  name     deg score
0  gta      BE    90
1  rat  B.Tech    67
2  lat    ITUS    00

In [17]:
df_d.to_csv('Yo.csv')

In [18]:
df_d.to_json('Yo.json')

In [19]:
df_p= pd.read_json('Yo.json')

In [20]:
df_p

  name     deg  score
0  gta      BE     90
1  rat  B.Tech     67
2  lat    ITUS      0

In [24]:
df_p.to_excel('Yo.xlsx')

In [25]:
df_p

  name     deg  score
0  gta      BE     90
1  rat  B.Tech     67
2  lat    ITUS      0